app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 2) LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`name`, `title`, `content`, `created_at`, `updated_at`) VALUES ('hello world', '你好, rubyonrails', 'just 测试，\r\n\r\n你好 \r\n\r\nfoobar', '2010-12-22 16:15:31', '2010-12-22 16:15:31')

  def update
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 2) LIMIT 1